RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_sdhc.c
/* Mask which indicates interface change */
#define _CYHAL_SDIO_INTERFACE_CHANGE_MASK    ((uint32_t) ((uint32_t) CYHAL_SDIO_GOING_DOWN) | ((uint32_t) CYHAL_SDIO_COMING_UP))
const uint32_t MAX_FREQUENCY = 50000000;

/* List of available SDHC instances */
static SDHC_Type * const _CYHAL_SDHC_BASE_ADDRESSES[CY_IP_MXSDHC_INSTANCES] =
{
#ifdef SDHC0
    SDHC0,
#endif /* ifdef SDHC0 */

#ifdef SDHC1
    SDHC1,
#endif /* ifdef SDHC1 */
};

/* List of available SDHC interrupt sources */
static const _cyhal_system_irq_t _CYHAL_SDHC_IRQ_N[CY_IP_MXSDHC_INSTANCES] =
{
#ifdef SDHC0
    sdhc_0_interrupt_general_IRQn,
#endif /* ifdef SDHC0 */

#ifdef SDHC1
    sdhc_1_interrupt_general_IRQn,
#endif /* ifdef SDHC1 */
};

/* SDHC/SDIO I/O voltage select principle.
*  Internal version of cyhal_sdhc_io_volt_action_type_t and cyhal_sdio_io_volt_action_type_t */
typedef enum
{
    _CYHAL_SDXX_IO_VOLT_ACTION_NEGOTIATE         = 0U,
    _CYHAL_SDXX_IO_VOLT_ACTION_SWITCH_SEQ_ONLY   = 1U,
    _CYHAL_SDXX_IO_VOLT_ACTION_NONE              = 2U,
} _cyhal_sdxx_io_switch_action_t;

/** I/O voltage levels.
 * Internal version of cyhal_sdhc_io_voltage_t and cyhal_sdio_io_voltage_t */
typedef enum
{
    _CYHAL_SDXX_IO_VOLTAGE_3_3V                  = 0U,   //!< I/O voltage is 3.3V.
    _CYHAL_SDXX_IO_VOLTAGE_1_8V                  = 1U    //!< I/O voltage is 1.8V.
} cyhal_sdxx_io_voltage_t;

#if defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)
#include "cyabs_rtos.h"

typedef enum
{
    /* Semaphore is not initialized */
    _CYHAL_SDXX_SEMA_NOT_INITED,
    /* Semaphore is initialized, but will not be used */
    _CYHAL_SDXX_SEMA_NOT_USED,
    /* Semaphore is initialized and used (expected to be set in IRQ handler) */
    _CYHAL_SDXX_SEMA_USED,
    /* Set in irq handler */
    _CYHAL_SDXX_SEMA_SET
} _cyhal_sdxx_semaphore_status_t;

/* _cyhal_sdxx_t would be the better place for keeping these items, but since
 * cy_semaphore_t depends on cyabs_rtos.h that results in circular includes/
 * messy forward declarations. */
static cy_semaphore_t _cyhal_sdxx_semaphore_xfer_done[CY_IP_MXSDHC_INSTANCES];
static _cyhal_sdxx_semaphore_status_t _cyhal_sdxx_semaphore_status[CY_IP_MXSDHC_INSTANCES];

static inline bool _cyhal_sdxx_is_smfr_ready_for_set(_cyhal_sdxx_t *sdxx)
{
    CY_ASSERT(sdxx != NULL);
    return (_CYHAL_SDXX_SEMA_USED == _cyhal_sdxx_semaphore_status[sdxx->resource.block_num]);
}

static inline bool _cyhal_sdxx_is_smfr_ready_for_get(_cyhal_sdxx_t *sdxx)
{
    CY_ASSERT(sdxx != NULL);
    return (_CYHAL_SDXX_SEMA_USED == _cyhal_sdxx_semaphore_status[sdxx->resource.block_num]) ||
                (_CYHAL_SDXX_SEMA_SET == _cyhal_sdxx_semaphore_status[sdxx->resource.block_num]);
}

#endif /* CY_RTOS_AWARE or COMPONENT_RTOS_AWARE defined */

static cy_rslt_t _cyhal_sdxx_prepare_for_transfer(_cyhal_sdxx_t *sdxx)
{
    CY_ASSERT(sdxx != NULL);

    uint32_t activated_cmd_complete = 0;
    if (sdxx->irq_cause & (sdxx->is_sdio ? CYHAL_SDIO_CMD_COMPLETE : CYHAL_SDHC_CMD_COMPLETE))
    {
        /* Activate CY_SD_HOST_CMD_COMPLETE interrupt mask only if user enabled callback for that event */
        activated_cmd_complete = CY_SD_HOST_CMD_COMPLETE;
    }

    /* Enabling transfer complete interrupt as it takes part in in write / read processes */
    Cy_SD_Host_SetNormalInterruptMask(sdxx->base, Cy_SD_Host_GetNormalInterruptMask(sdxx->base) | activated_cmd_complete | CY_SD_HOST_XFER_COMPLETE);

    return CY_RSLT_SUCCESS;
}

typedef enum
{
    _CYHAL_SDHC_CARD_VDD                    = 0,
    _CYHAL_SDHC_CARD_IO_VOLTAGE             = 1,
    _CYHAL_SDHC_CARD_DETECT                 = 2,
    _CYHAL_SDHC_CARD_MECH_WRITE_PROTECT     = 3,
    _CYHAL_SDHC_NOT_WEAK_FUNC               = 4
} _cyhal_sdhc_weak_func_type;

static _cyhal_sdxx_t *_cyhal_sdxx_config_structs[CY_IP_MXSDHC_INSTANCES];

/* Structure to map SDHC events on SDHC interrupts */
static const uint32_t _cyhal_sdhc_event_map[] =
{
    (uint32_t)CYHAL_SDHC_ERR_INTERRUPT,   // Default error if nothing is recognized
    (uint32_t)CYHAL_SDHC_CMD_COMPLETE,    // CY_SD_HOST_CMD_COMPLETE
    (uint32_t)CYHAL_SDHC_XFER_COMPLETE,   // CY_SD_HOST_XFER_COMPLETE
    (uint32_t)CYHAL_SDHC_BGAP_EVENT,      // CY_SD_HOST_BGAP
    (uint32_t)CYHAL_SDHC_DMA_INTERRUPT,   // CY_SD_HOST_DMA_INTERRUPT
    (uint32_t)CYHAL_SDHC_BUF_WR_READY,    // CY_SD_HOST_BUF_WR_READY
    (uint32_t)CYHAL_SDHC_BUF_RD_READY,    // CY_SD_HOST_BUF_RD_READY
    (uint32_t)CYHAL_SDHC_CARD_INSERTION,  // CY_SD_HOST_CARD_INSERTION
    (uint32_t)CYHAL_SDHC_CARD_REMOVAL,    // CY_SD_HOST_CARD_REMOVAL
    /*  Placeholder of removed CYHAL_SDHC_CARD_INTERRUPT.
    *   It is needed for cyhal_sdhc_enable_event and _cyhal_utils_convert_flags
    *   functions correct work. */
    0,
    (uint32_t)CYHAL_SDHC_FX_EVENT,        // CY_SD_HOST_FX_EVENT
    (uint32_t)CYHAL_SDHC_CQE_EVENT,       // CY_SD_HOST_CQE_EVENT
    (uint32_t)CYHAL_SDHC_ERR_INTERRUPT,   // CY_SD_HOST_ERR_INTERRUPT
};


/* This callback is used when card detect pin is GPIO (not dedicated SDHC block signal) */
static void _cyhal_sdhc_gpio_card_detect_callback(void *callback_arg, cyhal_gpio_event_t event)
{
    CY_ASSERT(NULL != callback_arg);
    _cyhal_sdxx_t *sdxx = (_cyhal_sdxx_t *)callback_arg;

    if (sdxx->callback_data.callback != NULL)
    {
        cyhal_sdhc_event_callback_t callback = (cyhal_sdhc_event_callback_t) sdxx->callback_data.callback;

        /* Card is considered as inserted if card_detect pin in low state. */

        /* Card removal event */
        if ((event & CYHAL_GPIO_IRQ_RISE) && (sdxx->irq_cause & CYHAL_SDHC_CARD_REMOVAL))
        {
            /* Call registered callbacks here */
            (callback) (sdxx->callback_data.callback_arg, CYHAL_SDHC_CARD_REMOVAL);
        }
        /* Card insertion event */
        if ((event & CYHAL_GPIO_IRQ_FALL) && (sdxx->irq_cause & CYHAL_SDHC_CARD_INSERTION))
        {
            /* Call registered callbacks here */
            (callback) (sdxx->callback_data.callback_arg, CYHAL_SDHC_CARD_INSERTION);
        }
    }
}

