RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_sdhc.c
#if !defined(CYHAL_DISABLE_WEAK_FUNC_IMPL)

/*  Function, that handles pins that stands behind SD Host PDL driver pin-related WEAK functions, such as:
*   - Cy_SD_Host_IsCardConnected
*   - Cy_SD_Host_IsWpSet
*   - Cy_SD_Host_EnableCardVoltage
*   - Cy_SD_Host_DisableCardVoltage
*   - Cy_SD_Host_ChangeIoVoltage
*   To make their usage in SDHC HAL driver more flexible by providing user ability to use card detect,
*   write protect, pwr en, and io select signals on pins they like instead of dedicated SDHC block pins */
static bool _cyhal_sdxx_handle_weak_func(const SDHC_Type *base, _cyhal_sdhc_weak_func_type weak_function, bool enable)
{
    uint8_t block_idx = (SDHC0 == base) ? 0 : 1;
    _cyhal_sdxx_t *sdxx = _cyhal_sdxx_config_structs[block_idx];
    CY_ASSERT(NULL != sdxx);

    cyhal_gpio_t pin_pwr_en;
    cyhal_gpio_t pin_io_volt_sel;
    cyhal_gpio_t pin_card_detect;
    cyhal_gpio_t pin_write_prot;

    CY_ASSERT((weak_function == _CYHAL_SDHC_CARD_VDD) || (weak_function == _CYHAL_SDHC_CARD_IO_VOLTAGE) ||
            (weak_function == _CYHAL_SDHC_CARD_DETECT) || (weak_function == _CYHAL_SDHC_CARD_MECH_WRITE_PROTECT));

    pin_io_volt_sel = sdxx->pin_io_vol_sel;

    if (sdxx->is_sdio)
    {
        pin_pwr_en = NC;
        pin_card_detect = NC;
        pin_write_prot = NC;
    }
    else
    {
        cyhal_sdhc_t *sdhc = (cyhal_sdhc_t *) sdxx->obj;
        pin_pwr_en = sdhc->pin_card_pwr_en;
        pin_card_detect = sdhc->pin_card_detect;
        pin_write_prot = sdhc->pin_card_mech_write_prot;
    }

    /* function index */
    uint8_t f_idx = (uint8_t)weak_function;

    /* Indexes according to _cyhal_sdhc_weak_func_type */
    static const cyhal_resource_pin_mapping_t* pin_mappings[] = {
            cyhal_pin_map_sdhc_card_if_pwr_en, cyhal_pin_map_sdhc_io_volt_sel, cyhal_pin_map_sdhc_card_detect_n,
            cyhal_pin_map_sdhc_card_mech_write_prot
        };
    static const size_t pin_mapping_sizes[] = {
            _CYHAL_SDHC_ELEM_COUNT(cyhal_pin_map_sdhc_card_if_pwr_en), _CYHAL_SDHC_ELEM_COUNT(cyhal_pin_map_sdhc_io_volt_sel),
            _CYHAL_SDHC_ELEM_COUNT(cyhal_pin_map_sdhc_card_detect_n), _CYHAL_SDHC_ELEM_COUNT(cyhal_pin_map_sdhc_card_mech_write_prot)
        };
    cyhal_gpio_t pins[] = { pin_pwr_en, pin_io_volt_sel, pin_card_detect, pin_write_prot };

    /*  Per sd_host PDL documentation (documentation for Cy_SD_Host_ChangeIoVoltage),
    *   SIGNALING_EN bit of the SDHC_CORE_HOST_CTRL2_R register must be set even if
    *   GPIO used for io voltage switching. */
    if (_CYHAL_SDHC_CARD_IO_VOLTAGE == weak_function)
    {
        SDHC_CORE_HOST_CTRL2_R(base) = _CLR_SET_FLD16U(SDHC_CORE_HOST_CTRL2_R(base),
                SDHC_CORE_HOST_CTRL2_R_SIGNALING_EN, enable);

        /* enable (true) stands for 1.8V while false for 3.3V */
        sdxx->low_voltage_io_set = enable;
    }

    /* Pin is not provided by user */
    if (NC == pins[f_idx])
    {
        /* Return true for card detect, false for write protect and false for other (dont care) */
        return (weak_function == _CYHAL_SDHC_CARD_DETECT) ? true : false;
    }
    /* Pin is GPIO */
    else if (NULL == _cyhal_utils_get_resource(pins[f_idx], pin_mappings[f_idx], pin_mapping_sizes[f_idx], NULL, false))
    {
        if (weak_function == _CYHAL_SDHC_CARD_DETECT)
        {
            /* Card is inserted if signal is low */
            return !cyhal_gpio_read(pins[f_idx]);
        }
        else if (weak_function == _CYHAL_SDHC_CARD_MECH_WRITE_PROTECT)
        {
            /* Card is mech. write protected if signal is high */
            return cyhal_gpio_read(pins[f_idx]);
        }
        /* _CYHAL_SDHC_CARD_VDD or _CYHAL_SDHC_CARD_IO_VOLTAGE */
        else
        {
            cyhal_gpio_write(pins[f_idx], enable);
            /* Don't care */
            return true;
        }
    }
    /* Pin is dedicated SDHC block signal */
    else
    {
        /* Actually copies of corresponding functions from cy_sd_host.c */
        switch(weak_function)
        {
            case _CYHAL_SDHC_CARD_VDD:
                SDHC_CORE_PWR_CTRL_R(base) =
                        _CLR_SET_FLD8U(SDHC_CORE_PWR_CTRL_R(base), SDHC_CORE_PWR_CTRL_R_SD_BUS_PWR_VDD1, enable);
                break;
            case _CYHAL_SDHC_CARD_DETECT:
                while(true != _FLD2BOOL(SDHC_CORE_PSTATE_REG_CARD_STABLE, SDHC_CORE_PSTATE_REG(base)))
                {
                    /* Wait until the card is stable. */
                }
                return _FLD2BOOL(SDHC_CORE_PSTATE_REG_CARD_INSERTED, SDHC_CORE_PSTATE_REG(base));
            case _CYHAL_SDHC_CARD_MECH_WRITE_PROTECT:
                return _FLD2BOOL(SDHC_CORE_PSTATE_REG_WR_PROTECT_SW_LVL, SDHC_CORE_PSTATE_REG(base));
            case _CYHAL_SDHC_CARD_IO_VOLTAGE:
                /* io voltage already handled above */
                (void)0;
                break;
            default:
                CY_ASSERT(false);
                break;
        }
        /* dont care */
        return true;
    }
}

/* Overriden Cy_SD_Host_IsCardConnected (originally part of cy_sd_host.c)
*  This version can handle both - dedicated IP block sdhc_card_detect_n pin and
*  user-provided GPIO */
bool Cy_SD_Host_IsCardConnected(SDHC_Type const *base)
{
    return _cyhal_sdxx_handle_weak_func(base, _CYHAL_SDHC_CARD_DETECT, false);
}

/* Overriden Cy_SD_Host_IsWpSet function (originally part of cy_sd_host.c).
*  This version can handle both - dedicated IP block sdhc_card_mech_write_prot pin
*  and user-provided GPIO */
bool Cy_SD_Host_IsWpSet(SDHC_Type const *base)
{
    return _cyhal_sdxx_handle_weak_func(base, _CYHAL_SDHC_CARD_MECH_WRITE_PROTECT, false);
}

/* Overriden Cy_SD_Host_EnableCardVoltage and Cy_SD_Host_DisableCardVoltage
*  functions (originally part of in cy_sd_host.c).
*  This version can handle both - dedicated IP block sdhc_card_if_pwr_en pin and
*  user-provided GPIO */
void Cy_SD_Host_EnableCardVoltage(SDHC_Type *base)
{
    (void)_cyhal_sdxx_handle_weak_func(base, _CYHAL_SDHC_CARD_VDD, true);
}
void Cy_SD_Host_DisableCardVoltage(SDHC_Type *base)
{
    (void)_cyhal_sdxx_handle_weak_func(base, _CYHAL_SDHC_CARD_VDD, false);
}

/* Overriden Cy_SD_Host_ChangeIoVoltage function (originally part of cy_sd_host.c).
*  This version can handle both - dedicated IP block sdhc_io_volt_sel pin
*  and user-provided GPIO */
void Cy_SD_Host_ChangeIoVoltage(SDHC_Type *base, cy_en_sd_host_io_voltage_t ioVoltage)
{
    (void)_cyhal_sdxx_handle_weak_func(base, _CYHAL_SDHC_CARD_IO_VOLTAGE, (CY_SD_HOST_IO_VOLT_1_8V == ioVoltage));
}

