RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_sdhc.c
#endif /* CYHAL_DISABLE_WEAK_FUNC_IMPL */

static uint8_t _cyhal_sdhc_get_block_from_irqn(_cyhal_system_irq_t irqn)
{
    switch (irqn)
    {
#if (CY_CPU_CORTEX_M4)
    #if (CY_IP_MXSDHC_INSTANCES > 0)
        case sdhc_0_interrupt_general_IRQn: return 0;
    #endif

    #if (CY_IP_MXSDHC_INSTANCES > 1)
        case sdhc_1_interrupt_general_IRQn: return 1;
    #endif

    #if (CY_IP_MXSDHC_INSTANCES > 2)
        #error "Unhandled SDHC count"
    #endif
#endif /* (CY_CPU_CORTEX_M4) */
    default:
        CY_ASSERT(false); /* Should never be called with a non-SDHC IRQn */
        return 0;
    }
}

static cy_rslt_t _cyhal_sdxx_setup_pin(_cyhal_sdxx_t *sdxx, cyhal_gpio_t pin, const cyhal_resource_pin_mapping_t *pinmap, uint8_t drive_mode,
    size_t count, cyhal_gpio_t *objRef, _cyhal_sdhc_weak_func_type weak_func_pin_type, bool reserve_pin)
{
    cy_rslt_t result;
    const cyhal_resource_pin_mapping_t *map = _cyhal_utils_get_resource(pin, pinmap, count, NULL, false);

    if (map == NULL)
    {
        result = CYHAL_SDHC_RSLT_ERR_PIN;
        if (_CYHAL_SDHC_NOT_WEAK_FUNC != weak_func_pin_type)
        {
            /* pin, provided by user is probably not dedicated SDHC signal, but GPIO */
            switch(weak_func_pin_type)
            {
                case _CYHAL_SDHC_CARD_DETECT:
                case _CYHAL_SDHC_CARD_MECH_WRITE_PROTECT:
                    result = reserve_pin
                        ? cyhal_gpio_init(pin, CYHAL_GPIO_DIR_INPUT, CYHAL_GPIO_DRIVE_NONE, true)
                        : CY_RSLT_SUCCESS;
                    break;
                case _CYHAL_SDHC_CARD_VDD:
                case _CYHAL_SDHC_CARD_IO_VOLTAGE:
                    result = reserve_pin
                        ? cyhal_gpio_init(pin, CYHAL_GPIO_DIR_OUTPUT, CYHAL_GPIO_DRIVE_STRONG, false)
                        : CY_RSLT_SUCCESS;
                    break;
                default:
                    CY_ASSERT(false); /* Should never get here. */
            }
        }
        if ((_CYHAL_SDHC_CARD_DETECT == weak_func_pin_type) && (CY_RSLT_SUCCESS == result))
        {
            // Ensure the two structures are the same. Divide by 0 build error if they differ.
            CY_ASSERT(1 / (sizeof(struct cyhal_sdhc_t_gpio_cb) == sizeof(cyhal_gpio_callback_data_t)));

            cyhal_sdhc_t* sdhc = ((cyhal_sdhc_t*) sdxx->obj);
            cyhal_gpio_callback_data_t* cb_data = (cyhal_gpio_callback_data_t*)&(sdhc->card_detect_cb);
            cb_data->callback = _cyhal_sdhc_gpio_card_detect_callback;
            cb_data->callback_arg = sdxx;
            cyhal_gpio_register_callback(pin, cb_data);
            cyhal_gpio_enable_event(pin, CYHAL_GPIO_IRQ_BOTH, CYHAL_ISR_PRIORITY_DEFAULT, true);
            sdhc->cd_gpio_cb_enabled = true;
        }
    }
    else
    {
        result = reserve_pin
            ? _cyhal_utils_reserve_and_connect(map, drive_mode)
            : CY_RSLT_SUCCESS;
    }

    if (result == CY_RSLT_SUCCESS)
    {
        *objRef = pin;
    }

    return result;
}

bool _cyhal_sdhc_is_busy(const _cyhal_sdxx_t *sdxx) {
    bool busy_status = true;
    /* Check DAT Line Active */
    uint32_t pState = Cy_SD_Host_GetPresentState(sdxx->base);
    if ((CY_SD_HOST_DAT_LINE_ACTIVE != (pState & CY_SD_HOST_DAT_LINE_ACTIVE)) &&
        (CY_SD_HOST_CMD_CMD_INHIBIT_DAT != (pState & CY_SD_HOST_CMD_CMD_INHIBIT_DAT)))
    {
        busy_status = false;
    }
    return busy_status || (_CYHAL_SDXX_NOT_RUNNING != sdxx->data_transfer_status);
}


bool _cyhal_sdio_is_busy(const _cyhal_sdxx_t *sdxx) {
    return (_CYHAL_SDXX_NOT_RUNNING != sdxx->data_transfer_status);
}

/*******************************************************************************
*       Deep Sleep Callback Service Routine
*******************************************************************************/
static bool _cyhal_sdio_syspm_callback(cyhal_syspm_callback_state_t state, cyhal_syspm_callback_mode_t mode, void *callback_arg)
{
    bool allow = true;
    _cyhal_sdxx_t *sdxx = (_cyhal_sdxx_t *)callback_arg;
    CY_ASSERT(sdxx != NULL);

    cyhal_sdio_t *sdio = (cyhal_sdio_t *) sdxx->obj;

    cy_stc_syspm_callback_params_t pdl_params =
    {
        .base = sdxx->base,
        .context = &(sdxx->context)
    };

    /* Check if hardware is ready to go sleep using lower level callback. */
    if (state == CYHAL_SYSPM_CB_CPU_DEEPSLEEP)
    {
        allow = (Cy_SD_Host_DeepSleepCallback(&pdl_params, _cyhal_utils_convert_haltopdl_pm_mode(mode)) == CY_SYSPM_SUCCESS);
    }

    if (allow)
    {
        switch (mode)
        {
            case CYHAL_SYSPM_CHECK_READY:
            {
                allow = !_cyhal_sdio_is_busy(sdxx);
                if (allow)
                {
                    /* Call the event only if we are ready to go to sleep */
                    cyhal_sdio_event_callback_t callback = (cyhal_sdio_event_callback_t) sdxx->callback_data.callback;
                    if ((callback != NULL) && (0U != (sdio->events & (uint32_t) CYHAL_SDIO_GOING_DOWN)))
                    {
                        (callback)(sdxx->callback_data.callback_arg, CYHAL_SDIO_GOING_DOWN);
                    }
                    /* Set transition flag to prevent any further transaction */
                    sdxx->pm_transition_pending = true;
                }
                break;
            }

            case CYHAL_SYSPM_BEFORE_TRANSITION:
            case CYHAL_SYSPM_AFTER_DS_WFI_TRANSITION:
            {
                /* Nothing to do */
                break;
            }

            case CYHAL_SYSPM_AFTER_TRANSITION:
            case CYHAL_SYSPM_CHECK_FAIL:
            {
                /* Execute this only if check ready case was executed */
                if (sdxx->pm_transition_pending)
                {
                    /* Execute callback to indicate that interface is coming up */
                    cyhal_sdio_event_callback_t callback = (cyhal_sdio_event_callback_t) sdxx->callback_data.callback;
                    if ((callback != NULL) && (0U != (sdio->events & (uint32_t) CYHAL_SDIO_COMING_UP)))
                    {
                        (callback)(sdxx->callback_data.callback_arg, CYHAL_SDIO_COMING_UP);
                    }

                    sdxx->pm_transition_pending = false;
                }
                break;
            }

            default:
                CY_ASSERT(false);
                break;
        }
    }
    return allow;
}

