RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_sdhc.c
static bool _cyhal_sdhc_syspm_callback(cyhal_syspm_callback_state_t state, cyhal_syspm_callback_mode_t mode, void *callback_arg)
{
    bool allow = true;
    _cyhal_sdxx_t *sdxx = (_cyhal_sdxx_t *)callback_arg;
    CY_ASSERT(sdxx != NULL);

    cy_stc_syspm_callback_params_t pdl_params =
    {
        .base = sdxx->base,
        .context = &(sdxx->context)
    };

    /* Check if hardware is ready to go sleep using lower level callback. */
    if (state == CYHAL_SYSPM_CB_CPU_DEEPSLEEP)
    {
        allow = (Cy_SD_Host_DeepSleepCallback(&pdl_params, _cyhal_utils_convert_haltopdl_pm_mode(mode)) == CY_SYSPM_SUCCESS);
    }

    if (allow)
    {
        switch (mode)
        {
            case CYHAL_SYSPM_CHECK_READY:
            {
                allow = !_cyhal_sdhc_is_busy(sdxx);
                if (allow)
                {
                    /* Set transition flag to prevent any further transaction */
                    sdxx->pm_transition_pending = true;
                }
                break;
            }

            case CYHAL_SYSPM_BEFORE_TRANSITION:
            {
                /* Nothing to do */
                break;
            }

            case CYHAL_SYSPM_AFTER_TRANSITION:
            case CYHAL_SYSPM_CHECK_FAIL:
            {
                /* Execute this only if check ready case was executed */
                sdxx->pm_transition_pending = false;
                break;
            }

            default:
                CY_ASSERT(false);
                break;
        }
    }
    return allow;
}

static cy_en_sd_host_bus_width_t _cyhal_sdhc_buswidth_hal_to_pdl(uint8_t sd_data_bits)
{
    switch (sd_data_bits)
    {
        case 1:
            return CY_SD_HOST_BUS_WIDTH_1_BIT;
        case 4:
            return CY_SD_HOST_BUS_WIDTH_4_BIT;
        case 8:
            return CY_SD_HOST_BUS_WIDTH_8_BIT;
        default:
            CY_ASSERT(false);
            return CY_SD_HOST_BUS_WIDTH_1_BIT;
    }
}

static uint8_t _cyhal_sdhc_buswidth_pdl_to_hal(cy_en_sd_host_bus_width_t sd_data_bits)
{
    switch (sd_data_bits)
    {
        case CY_SD_HOST_BUS_WIDTH_1_BIT:
            return 1;
        case CY_SD_HOST_BUS_WIDTH_4_BIT:
            return 4;
        case CY_SD_HOST_BUS_WIDTH_8_BIT:
            return 8;
        default:
            CY_ASSERT(false);
            return 1;
    }
}

/***********************************************************************************************************************
*
* Finds SDHC internal divider value according to source clock frequency and desired frequency.
*
* hz_src                - Source clock frequency, that needs to be divided
* desired_hz            - Desired clock frequency
* tolerance             - (Not used)
* only_below_desired    - (Not used)
* div                   - Calculated divider value will be placed by this pointer
*
***********************************************************************************************************************/
static cy_rslt_t _cyhal_sdxx_find_best_div(uint32_t hz_src, uint32_t desired_hz,
            const cyhal_clock_tolerance_t *tolerance, bool only_below_desired, uint32_t *div)
{
    CY_UNUSED_PARAMETER(tolerance);
    CY_UNUSED_PARAMETER(only_below_desired);

    /* Rounding up for correcting the error in integer division
    * to ensure the actual frequency is less than or equal to
    * the requested frequency.
    * Ensure computed divider is no more than 10-bit.
    */

    if (hz_src > desired_hz)
    {
        uint32_t freq = (desired_hz << 1);
        uint32_t calculated_divider = ((hz_src + freq - 1) / freq) & 0x3FF;
        /* Real divider is 2 x calculated_divider */
        *div = calculated_divider << 1;
    }
    else
    {
        *div = 1;
    }

    return CY_RSLT_SUCCESS;
}

/***********************************************************************************************************************
*
* Determines SD bus speed mode according to provided clock frequency and updates SDHC HW registers with corresponding
*   speed mode setting and, optionally, negotiates new speed mode with the card
*
* sdxx                  - Pointer to SDHC/SDIO common structure
* freq                  - Clock frequency, according to which speed mode will be determined
* lv_signaling          - Support 1.8V
* negotiate             - Whether new frequency value needs to be negotiated with the card
*
***********************************************************************************************************************/
static cy_rslt_t _cyhal_sdxx_update_hw_clock_config(_cyhal_sdxx_t *sdxx, uint32_t freq, bool lv_signaling, bool negotiate)
{
    cy_en_sd_host_bus_speed_mode_t  busSpeed;
    cy_rslt_t                       result;

    if (!sdxx->is_sdio && sdxx->emmc)
    {
        /* legacy MMC speed is 0-26 MHz */
        if (freq <= _CYHAL_SDXX_MHZ(26))
        {
            busSpeed = CY_SD_HOST_BUS_SPEED_EMMC_LEGACY;
        }
        /* High Speed SDR is 0-52 MHz */
        else
        {
            busSpeed = CY_SD_HOST_BUS_SPEED_EMMC_HIGHSPEED_SDR;
        }
    }
    else
    {
        if (freq <= _CYHAL_SDXX_MHZ(25))
        {
            busSpeed = (lv_signaling)
                ? CY_SD_HOST_BUS_SPEED_SDR12_5
                : CY_SD_HOST_BUS_SPEED_DEFAULT;
        }
        else if (freq <= _CYHAL_SDXX_MHZ(50))
        {
            busSpeed = (lv_signaling)
                ? CY_SD_HOST_BUS_SPEED_SDR25
                : CY_SD_HOST_BUS_SPEED_HIGHSPEED;
        }
        else
        {
            busSpeed = (lv_signaling)
                ? CY_SD_HOST_BUS_SPEED_SDR50
                : CY_SD_HOST_BUS_SPEED_HIGHSPEED;
        }
    }

    /*  Currently can only negotiate with SD Card. SDIO negotiation proccess is tracked in BSP-2643. */
    if (negotiate && !sdxx->is_sdio)
    {
        result = (cy_rslt_t)Cy_SD_Host_SetBusSpeedMode(sdxx->base, busSpeed, &(sdxx->context));
    }
    else
    {
        result = (cy_rslt_t)Cy_SD_Host_SetHostSpeedMode(sdxx->base, busSpeed);
    }
    return result;
}

