RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_sdhc.c
    /* Reserve SDHC */
    const cyhal_resource_pin_mapping_t *map = _CYHAL_UTILS_GET_RESOURCE(cmd, cyhal_pin_map_sdhc_card_cmd);

    if (NULL == map || NC == data[0])
    {
        // return now, nothing has been allocated so no need to proceed on
        return CYHAL_SDHC_RSLT_ERR_PIN;
    }

    cyhal_resource_inst_t rsc = { CYHAL_RSC_SDHC, map->block_num, map->channel_num };

    /* Reserve and configure GPIO pins */
    if (result == CY_RSLT_SUCCESS)
    {
        result = _cyhal_sdxx_setup_pin(
            sdxx, cmd, cyhal_pin_map_sdhc_card_cmd, CYHAL_PIN_MAP_DRIVE_MODE_SDHC_CARD_CMD,
            _CYHAL_SDHC_ELEM_COUNT(cyhal_pin_map_sdhc_card_cmd),
            &(sdxx->pin_cmd), _CYHAL_SDHC_NOT_WEAK_FUNC, !sdxx->dc_configured);
    }

    if (result == CY_RSLT_SUCCESS)
    {
        result = _cyhal_sdxx_setup_pin(
            sdxx, clk, cyhal_pin_map_sdhc_clk_card, CYHAL_PIN_MAP_DRIVE_MODE_SDHC_CLK_CARD,
            _CYHAL_SDHC_ELEM_COUNT(cyhal_pin_map_sdhc_clk_card),
            &(sdxx->pin_clk), _CYHAL_SDHC_NOT_WEAK_FUNC, !sdxx->dc_configured);
    }

    for (uint8_t i = 0; (i < 4) && (CY_RSLT_SUCCESS == result); i++)
    {
        if (NC != data[i])
        {
            result = _cyhal_sdxx_setup_pin(sdxx, data[i], cyhal_pin_map_sdhc_card_dat_3to0,
                    CYHAL_PIN_MAP_DRIVE_MODE_SDHC_CARD_DAT_3TO0,
                    _CYHAL_SDHC_ELEM_COUNT(cyhal_pin_map_sdhc_card_dat_3to0), &(obj->pin_data[i]),
                    _CYHAL_SDHC_NOT_WEAK_FUNC, !sdxx->dc_configured);
        }
    }

#if _CYHAL_SDHC_DATA8_PRESENT
    for (uint8_t i = 4; (i < 8) && (CY_RSLT_SUCCESS == result); i++)
    {
        if (NC != data[i])
        {
            result = _cyhal_sdxx_setup_pin(sdxx, data[i], cyhal_pin_map_sdhc_card_dat_7to4,
                    CYHAL_PIN_MAP_DRIVE_MODE_SDHC_CARD_DAT_7TO4,
                    _CYHAL_SDHC_ELEM_COUNT(cyhal_pin_map_sdhc_card_dat_7to4), &(obj->pin_data[i]),
                    _CYHAL_SDHC_NOT_WEAK_FUNC, !sdxx->dc_configured);
        }
    }
#else
    if ((NC != data[4] || NC != data[5] || NC != data[6] || NC != data[7]) && (CY_RSLT_SUCCESS == result))
    {
        result = CYHAL_SDHC_RSLT_ERR_PIN;
    }
#endif

    if ((NC != card_detect) && (CY_RSLT_SUCCESS == result))
    {
#if _CYHAL_SDHC_CARD_DETECT_PRESENT
        result = _cyhal_sdxx_setup_pin(sdxx, card_detect, cyhal_pin_map_sdhc_card_detect_n,
                CYHAL_PIN_MAP_DRIVE_MODE_SDHC_CARD_DETECT_N,
                _CYHAL_SDHC_ELEM_COUNT(cyhal_pin_map_sdhc_card_detect_n), &(obj->pin_card_detect),
                _CYHAL_SDHC_CARD_DETECT, !sdxx->dc_configured);
#else
        result = CYHAL_SDHC_RSLT_ERR_PIN;
#endif
    }

    if ((NC != io_volt_sel) && (CY_RSLT_SUCCESS == result))
    {
#if _CYHAL_SDHC_IO_VOLT_SEL_PRESENT
        result = _cyhal_sdxx_setup_pin(sdxx, io_volt_sel, cyhal_pin_map_sdhc_io_volt_sel,
            CYHAL_PIN_MAP_DRIVE_MODE_SDHC_IO_VOLT_SEL,
            _CYHAL_SDHC_ELEM_COUNT(cyhal_pin_map_sdhc_io_volt_sel), &(sdxx->pin_io_vol_sel),
            _CYHAL_SDHC_CARD_IO_VOLTAGE, !sdxx->dc_configured);
#else
        result = CYHAL_SDHC_RSLT_ERR_PIN;
#endif
    }

    if ((NC != card_pwr_en) && (CY_RSLT_SUCCESS == result))
    {
#if _CYHAL_SDHC_CARD_IF_PWR_EN_PRESENT
        result = _cyhal_sdxx_setup_pin(sdxx, card_pwr_en, cyhal_pin_map_sdhc_card_if_pwr_en,
            CYHAL_PIN_MAP_DRIVE_MODE_SDHC_CARD_IF_PWR_EN,
            _CYHAL_SDHC_ELEM_COUNT(cyhal_pin_map_sdhc_card_if_pwr_en), &(obj->pin_card_pwr_en), _CYHAL_SDHC_CARD_VDD,
            !sdxx->dc_configured);
#else
        result = CYHAL_SDHC_RSLT_ERR_PIN;
#endif
    }

    if ((NC != card_mech_write_prot) && (CY_RSLT_SUCCESS == result))
    {
#if _CYHAL_SDHC_CARD_WRITE_PROT_PRESENT
        result = _cyhal_sdxx_setup_pin(sdxx, card_mech_write_prot, cyhal_pin_map_sdhc_card_mech_write_prot,
            CYHAL_PIN_MAP_DRIVE_MODE_SDHC_CARD_MECH_WRITE_PROT,
            _CYHAL_SDHC_ELEM_COUNT(cyhal_pin_map_sdhc_card_mech_write_prot), &(obj->pin_card_mech_write_prot),
            _CYHAL_SDHC_CARD_MECH_WRITE_PROTECT, !sdxx->dc_configured);
#else
        result = CYHAL_SDHC_RSLT_ERR_PIN;
#endif
    }

    if ((NC != led_ctrl) && (CY_RSLT_SUCCESS == result))
    {
#if _CYHAL_SDHC_LED_CTRL_PRESENT
        result = _cyhal_sdxx_setup_pin(sdxx, led_ctrl, cyhal_pin_map_sdhc_led_ctrl,
            CYHAL_PIN_MAP_DRIVE_MODE_SDHC_LED_CTRL,
            _CYHAL_SDHC_ELEM_COUNT(cyhal_pin_map_sdhc_led_ctrl), &(obj->pin_led_ctrl), _CYHAL_SDHC_NOT_WEAK_FUNC, !sdxx->dc_configured);
#else
        result = CYHAL_SDHC_RSLT_ERR_PIN;
#endif
    }

    if ((NC != emmc_reset) && (CY_RSLT_SUCCESS == result))
    {
#if _CYHAL_SDHC_CARD_EMMC_RESET_PRESENT
        result = _cyhal_sdxx_setup_pin(sdxx, emmc_reset, cyhal_pin_map_sdhc_card_emmc_reset_n,
            CYHAL_PIN_MAP_DRIVE_MODE_SDHC_CARD_EMMC_RESET_N,
            _CYHAL_SDHC_ELEM_COUNT(cyhal_pin_map_sdhc_card_emmc_reset_n), &(obj->pin_emmc_reset),
            _CYHAL_SDHC_NOT_WEAK_FUNC, !sdxx->dc_configured);
#else
        result = CYHAL_SDHC_RSLT_ERR_PIN;
#endif
    }

    if (CY_RSLT_SUCCESS == result)
    {
        /* Clock was not provided, so allocate one */
        if (cfg->clock == NULL)
        {
            result = _cyhal_utils_allocate_clock(&(sdxx->clock), &rsc, CYHAL_CLOCK_BLOCK_PERIPHERAL_8BIT, true);

            if (CY_RSLT_SUCCESS == result)
            {
                sdxx->clock_owned = true;
                result = _cyhal_utils_set_clock_frequency2(&(sdxx->clock), MAX_FREQUENCY, &CYHAL_CLOCK_TOLERANCE_5_P);
            }

            if (CY_RSLT_SUCCESS == result && !cyhal_clock_is_enabled(&(sdxx->clock)))
            {
                result = cyhal_clock_set_enabled(&(sdxx->clock), true, true);
            }
        }
        else
        {
            if (cfg->clock->block == CYHAL_CLOCK_BLOCK_HF)
            {
                sdxx->clock = *cfg->clock;
                obj->bus_frequency_hz = cyhal_clock_get_frequency(&(sdxx->clock));
            }
            if ((cfg->clock->block != CYHAL_CLOCK_BLOCK_HF) || (obj->bus_frequency_hz == 0))
            {
                result = CYHAL_SDHC_RSLT_ERR_CLOCK;
            }
        }
    }

    if (CY_RSLT_SUCCESS == result)
    {
        if (sdxx->dc_configured)
        {
            sdxx->resource = *(cfg->resource);
        }
        else
        {
            result = cyhal_hwmgr_reserve(&rsc);
        }
    }

    if (CY_RSLT_SUCCESS == result)
    {
        sdxx->resource = rsc;
        sdxx->base = _CYHAL_SDHC_BASE_ADDRESSES[sdxx->resource.block_num];
        sdxx->data_transfer_status = _CYHAL_SDXX_NOT_RUNNING;
        #if defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)
        _cyhal_sdxx_semaphore_status[sdxx->resource.block_num] = _CYHAL_SDXX_SEMA_NOT_INITED;
        #endif /* defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE) */

        /* Enable the SDHC block */
        Cy_SD_Host_Enable(sdxx->base);

        sdxx->emmc = cfg->host_config->emmc;
        sdxx->context.cardType = CY_SD_HOST_NOT_EMMC;

