RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_sdhc.c
    cy_rslt_t ret;
    cy_stc_sd_host_write_read_config_t dataConfig;

    /* The pointer to data. */
    dataConfig.data = (uint32_t*)data;
    /* The address to write/read data on the card or eMMC. */
    dataConfig.address = address;
    /* The number of blocks to write/read. */
    dataConfig.numberOfBlocks = (uint32_t)*length;
    dataConfig.autoCommand = (1UL == (uint32_t)*length)
        ? CY_SD_HOST_AUTO_CMD_NONE
        : CY_SD_HOST_AUTO_CMD_AUTO;
    /* The timeout value for the transfer. */
    dataConfig.dataTimeout = obj->data_timeout_tout;
    /* For EMMC cards enable reliable write. */
    dataConfig.enReliableWrite = false;
    dataConfig.enableDma = true;

    /* First clear out the transfer and command complete statuses */
    Cy_SD_Host_ClearNormalInterruptStatus(sdxx->base, (CY_SD_HOST_XFER_COMPLETE | CY_SD_HOST_CMD_COMPLETE));

    ret = _cyhal_sdxx_prepare_for_transfer(sdxx);

    if (CY_RSLT_SUCCESS == ret)
    {
        // The PDL takes care of the cmd complete stage in sdhc mode so we can jump straight
        // to waiting for the xfer complete
        sdxx->data_transfer_status = _CYHAL_SDXX_WAIT_XFER_COMPLETE;
        ret = (cy_rslt_t)Cy_SD_Host_Read(sdxx->base, &dataConfig, &(sdxx->context));
        /* Read operation failed */
        if (CY_RSLT_SUCCESS != ret)
        {
            sdxx->data_transfer_status = _CYHAL_SDXX_NOT_RUNNING;
        }
    }

    return ret;
}

cy_rslt_t cyhal_sdhc_write_async(cyhal_sdhc_t *obj, uint32_t address, const uint8_t *data, size_t *length)
{
    _cyhal_sdxx_t *sdxx = &(obj->sdxx);

    if (sdxx->pm_transition_pending)
    {
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;
    }

    cy_rslt_t ret;
    cy_stc_sd_host_write_read_config_t dataConfig;

    /* The pointer to data. */
    dataConfig.data = (uint32_t*)data;
    /* The address to write/read data on the card or eMMC. */
    dataConfig.address = address;
    /* The number of blocks to write/read. */
    dataConfig.numberOfBlocks = (uint32_t)*length;
    dataConfig.autoCommand = (1UL == (uint32_t)*length)
        ? CY_SD_HOST_AUTO_CMD_NONE
        : CY_SD_HOST_AUTO_CMD_AUTO;
    /* The timeout value for the transfer. */
    dataConfig.dataTimeout = obj->data_timeout_tout;
    /* For EMMC cards enable reliable write. */
    dataConfig.enReliableWrite = false;
    dataConfig.enableDma = true;

    /* First clear out the transfer and command complete statuses */
    Cy_SD_Host_ClearNormalInterruptStatus(sdxx->base, (CY_SD_HOST_XFER_COMPLETE | CY_SD_HOST_CMD_COMPLETE));

    ret = _cyhal_sdxx_prepare_for_transfer(sdxx);

    if (CY_RSLT_SUCCESS == ret)
    {
        // The PDL takes care of the cmd complete stage in sdhc mode so we can jump straight
        // to waiting for the xfer complete
        sdxx->data_transfer_status = _CYHAL_SDXX_WAIT_XFER_COMPLETE;
        ret = (cy_rslt_t)Cy_SD_Host_Write(sdxx->base, &dataConfig, &(sdxx->context));
        /* Write operation failed */
        if (CY_RSLT_SUCCESS != ret)
        {
            sdxx->data_transfer_status = _CYHAL_SDXX_NOT_RUNNING;
        }
    }

    return ret;
}

bool cyhal_sdhc_is_busy(const cyhal_sdhc_t *obj)
{
    CY_ASSERT(NULL != obj);
    return _cyhal_sdhc_is_busy(&(obj->sdxx));
}

cy_rslt_t cyhal_sdhc_abort_async(cyhal_sdhc_t *obj)
{
    _cyhal_sdxx_t *sdxx = &(obj->sdxx);
    cy_rslt_t ret = (cy_rslt_t)Cy_SD_Host_AbortTransfer(sdxx->base, &(sdxx->context));
    if (CY_RSLT_SUCCESS == ret)
    {
        sdxx->data_transfer_status = _CYHAL_SDXX_NOT_RUNNING;
    }
    return ret;
}

void cyhal_sdhc_register_callback(cyhal_sdhc_t *obj, cyhal_sdhc_event_callback_t callback, void *callback_arg)
{
    _cyhal_sdxx_t *sdxx = &(obj->sdxx);
    uint32_t savedIntrStatus = cyhal_system_critical_section_enter();
    sdxx->callback_data.callback = (cy_israddress) callback;
    sdxx->callback_data.callback_arg = callback_arg;
    cyhal_system_critical_section_exit(savedIntrStatus);
}

void cyhal_sdhc_enable_event(cyhal_sdhc_t *obj, cyhal_sdhc_event_t event, uint8_t intr_priority, bool enable)
{
    _cyhal_sdxx_t *sdxx = &(obj->sdxx);

    uint32_t interruptMask = Cy_SD_Host_GetNormalInterruptMask(sdxx->base);

    _cyhal_system_irq_t irqn = _CYHAL_SDHC_IRQ_N[sdxx->resource.block_num];
    _cyhal_irq_set_priority(irqn, intr_priority);
    uint32_t map_count = sizeof(_cyhal_sdhc_event_map) / sizeof(uint32_t);

    /* Specific interrupt */
    if ((uint32_t) event < (uint32_t) CYHAL_SDHC_ALL_INTERRUPTS)
    {
        for (uint8_t i = 1; i < map_count; i++)
        {
            if ((_cyhal_sdhc_event_map[i] & (uint32_t) event) != 0)
            {
                if (enable)
                    interruptMask |= ((uint32_t)1 << (i - 1));
                else
                    interruptMask &= ~((uint32_t)1 << (i - 1));
            }
        }
    }
    /* All interrupts */
    else
    {
        interruptMask = (enable) ? CYHAL_SDHC_ALL_INTERRUPTS : 0;
    }

    sdxx->irq_cause = interruptMask;
    /*  CY_SD_HOST_CMD_COMPLETE and CY_SD_HOST_XFER_COMPLETE cannot be always enabled because of SD Host driver limitations.
    *   SDHC HAL transfer APIs are taking care of enabling these statuses. CY_SD_HOST_CMD_COMPLETE is only
    *   enabled if user callback is enabled while CY_SD_HOST_XFER_COMPLETE is enabled by transfer API regardless it was enabled
    *   by user or not. */
    interruptMask &= ((uint32_t) ~CY_SD_HOST_CMD_COMPLETE) & ((uint32_t) ~CY_SD_HOST_XFER_COMPLETE);
    Cy_SD_Host_SetNormalInterruptMask(sdxx->base, interruptMask);
}

bool cyhal_sdhc_is_card_inserted(const cyhal_sdhc_t *obj)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != obj->sdxx.base);
    return Cy_SD_Host_IsCardConnected(obj->sdxx.base);
}

bool cyhal_sdhc_is_card_mech_write_protected(const cyhal_sdhc_t *obj)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != obj->sdxx.base);
    return Cy_SD_Host_IsWpSet(obj->sdxx.base);
}

cy_rslt_t cyhal_sdhc_get_block_count(cyhal_sdhc_t *obj, uint32_t * block_count)
{
    CY_ASSERT(NULL != obj);

