RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_sdhc.c
    uint32_t p_state;
    cy_rslt_t result = CY_RSLT_SUCCESS;

    /* Disable providing the SD Clock. */
    Cy_SD_Host_DisableSdClk(base);

    p_state = Cy_SD_Host_GetPresentState(base) & SDHC_CORE_PSTATE_REG_DAT_3_0_Msk;

    /* Check DAT[3:0]. */
    if (0UL == p_state)
    {
        /* Switch the bus to 1.8 V (Set the IO_VOLT_SEL pin to low)*/
        Cy_SD_Host_ChangeIoVoltage(base, CY_SD_HOST_IO_VOLT_1_8V);

        /* Wait 10 ms to 1.8 voltage regulator to be stable. */
        cyhal_system_delay_ms(_CYHAL_SDHC_1_8_REG_STABLE_TIME_MS);

        /* Check the 1.8V signaling enable. */
        if (true == _FLD2BOOL(SDHC_CORE_HOST_CTRL2_R_SIGNALING_EN,
                            SDHC_CORE_HOST_CTRL2_R(base)))
        {
            /* Enable providing the SD Clock. */
            Cy_SD_Host_EnableSdClk(base);

            /* Wait for the stable CLK */
            cyhal_system_delay_ms(CY_SD_HOST_CLK_RAMP_UP_TIME_MS);

            p_state = Cy_SD_Host_GetPresentState(base) & SDHC_CORE_PSTATE_REG_DAT_3_0_Msk;

            /* Check DAT[3:0]. */
            if (SDHC_CORE_PSTATE_REG_DAT_3_0_Msk != p_state)
            {
                result = (cy_rslt_t)CY_SD_HOST_ERROR;
            }
        }
        else
        {
            result = (cy_rslt_t)CY_SD_HOST_ERROR;
        }
    }
    else
    {
        result = (cy_rslt_t)CY_SD_HOST_ERROR;
    }

    return result;
}

/* Ncc - is time, needed to wait after certain commands before issuing next cmd.
*  Ncc is 8 clock cycles which for 400 kHz is 20 us */
static inline void _cyhal_sdhc_wait_ncc_time_at_400khz(void)
{
    cyhal_system_delay_us(20);
}

static cy_rslt_t _cyhal_sdhc_io_volt_negotiate(cyhal_sdhc_t *obj, cyhal_sdhc_io_voltage_t io_voltage)
{
    /* GO_IDLE (CMD0) command is issued in scope of Cy_SD_Host_SelBusVoltage, which resets
    *  SD bus to 1 bit bus width and 400 khz on the SD card side. Preparing host side for that. */

    _cyhal_sdxx_t *sdxx = &(obj->sdxx);

    /* 1 bit data bus width */
    cy_rslt_t result = cyhal_sdhc_set_bus_width(obj, 1, true);

    if (CY_RSLT_SUCCESS == result)
    {
        /* 400 khz sd bus clock */
        result = cyhal_sdhc_set_frequency(obj, 400000, false);
    }

    if (CY_RSLT_SUCCESS == result)
    {
        bool voltage_1v8 = (io_voltage == CYHAL_SDHC_IO_VOLTAGE_1_8V);
        result = (cy_rslt_t)Cy_SD_Host_SelBusVoltage(sdxx->base, voltage_1v8, &(sdxx->context));
        /* Card is expected to be in "ready" state now */
    }

    if (CY_RSLT_SUCCESS == result)
    {
        /* GetCid (CMD2) will switch card from "ready" state to "ident" */
        uint32_t cid_reg[4];  /* The Device Identification register. */
        result = (cy_rslt_t)Cy_SD_Host_GetCid(sdxx->base, cid_reg);
        _cyhal_sdhc_wait_ncc_time_at_400khz();
    }

    if (CY_RSLT_SUCCESS == result)
    {
        /* Cy_SD_Host_GetRca (CMD3) will switch card from "ident" state to "stand-by" state */
        sdxx->context.RCA = Cy_SD_Host_GetRca(sdxx->base);
        _cyhal_sdhc_wait_ncc_time_at_400khz();

        /* CMD7 will switch card from "stand-by" state to "transfer" state */
        cyhal_sdhc_cmd_config_t cmd = {
            .command_index = 7,
            .command_argument = sdxx->context.RCA << _CYHAL_SDHC_RCA_SHIFT,
            .enable_crc_check = false,
            .response_type = CYHAL_SDHC_RESPONSE_LEN_48B,
            .enable_idx_check = false,
            .command_type = CYHAL_SDHC_CMD_NORMAL,
            .data_config = NULL
        };

        result = cyhal_sdhc_send_cmd(obj, &cmd);
    }

    if (CY_RSLT_SUCCESS == result)
    {
        _cyhal_sdhc_wait_ncc_time_at_400khz();
        result = _cyhal_sdxx_waitfor_transfer_complete(sdxx);
    }

    return result;
}

typedef struct
{
    en_hsiom_sel_t      clk;
    en_hsiom_sel_t      cmd;
    #if _CYHAL_SDHC_DATA8_PRESENT
    en_hsiom_sel_t      data[8];
    #else
    en_hsiom_sel_t      data[4];
    #endif
} _cyhal_sdhc_saved_lines_hsiom_t;

/* power cycle config single pin */
static void _cyhal_sdhc_pc_config_single_pin(cyhal_gpio_t *gpio_ptr, en_hsiom_sel_t *hsiom_ptr, bool set_line_low)
{
    GPIO_PRT_Type* port;
    uint8_t pin;

    cyhal_gpio_t gpio = *gpio_ptr;
    if (NC != gpio)
    {
        port = CYHAL_GET_PORTADDR(gpio);
        pin = (uint8_t)CYHAL_GET_PIN(gpio);
        if(set_line_low)
        {
            /* Switching HSIOM to GPIO and set pin to low state */
            *hsiom_ptr = Cy_GPIO_GetHSIOM(port, pin);
            Cy_GPIO_Clr(port, pin);
            Cy_GPIO_SetHSIOM(port, pin, HSIOM_SEL_GPIO);
        }
        else
        {
            /* Restore pin's HSIOM configuration for SDHC block signals */
            Cy_GPIO_SetHSIOM(port, pin, *hsiom_ptr);
        }
    }
}

/* Per SD Spec, during card power down, DAT, CMD and CLK lines should be disconnected or driven to logical 0
*  by the host to avoid operating current being drawn through the signal lines.
*  Lines are set low if set_lines_low true, pins configuration resored if set_lines_low false */
static void _cyhal_sdhc_power_cycle_config_lines(cyhal_sdhc_t *obj, _cyhal_sdhc_saved_lines_hsiom_t *pins_cfg,
    bool set_lines_low)
{
    _cyhal_sdhc_pc_config_single_pin(&(obj->sdxx.pin_clk), &pins_cfg->clk, set_lines_low);
    _cyhal_sdhc_pc_config_single_pin(&(obj->sdxx.pin_cmd), &pins_cfg->cmd, set_lines_low);
    for(size_t i = 0; i < sizeof(pins_cfg->data)/sizeof(pins_cfg->data[0]); ++i)
    {
        _cyhal_sdhc_pc_config_single_pin(&(obj->pin_data[i]), &(pins_cfg->data[i]), set_lines_low);
    }
}

static cy_rslt_t _cyhal_sdhc_card_power_cycle(cyhal_sdhc_t *obj)
{
    /* To perform reliable SD card hard reset, Card VDD should drop to below 0.5V for at least 1 ms */
    if (NC == obj->pin_card_pwr_en)
    {
        /* card_pwr_en needs to be provided in order to control card VDD */
        return CYHAL_SDHC_RSLT_ERR_PIN;
    }

    _cyhal_sdhc_saved_lines_hsiom_t pins_cfg;

    /* Drive signal lines logic 0 to avoid card being powered through signal lines */
    _cyhal_sdhc_power_cycle_config_lines(obj, &pins_cfg, true);
    /* Power down the card */
    cyhal_sdhc_enable_card_power(obj, false);
    /* Waiting for 1 ms per spec */
    cyhal_system_delay_us(1000);
    /* Restore signals configuration */
    _cyhal_sdhc_power_cycle_config_lines(obj, &pins_cfg, false);
    /* Power up the card */
    cyhal_sdhc_enable_card_power(obj, true);
    cyhal_system_delay_ms(_CYHAL_SDHC_PWR_RAMP_UP_TIME_MS);

    return CY_RSLT_SUCCESS;
}

static cy_rslt_t _cyhal_sdxx_set_io_voltage(_cyhal_sdxx_t *sdxx, cyhal_sdxx_io_voltage_t io_voltage,
                                           _cyhal_sdxx_io_switch_action_t io_switch_type)
{
    CY_ASSERT(NULL != sdxx);
    CY_ASSERT(NULL != sdxx->base);

    if ((!sdxx->is_sdio && CY_SD_HOST_SD != sdxx->context.cardType) &&
            (_CYHAL_SDXX_IO_VOLT_ACTION_NONE != io_switch_type))
    {
        /* For SDHC, Negotiation or Voltage switch is not supported when eMMC used */
        return CYHAL_SDHC_RSLT_ERR_UNSUPPORTED;
    }
    if (sdxx->is_sdio && (_CYHAL_SDXX_IO_VOLT_ACTION_NEGOTIATE == io_switch_type))
    {
        /* For SDIO, Negotiation is not supported */
        return CYHAL_SDIO_RSLT_ERR_UNSUPPORTED;
    }

    cy_rslt_t result = CY_RSLT_SUCCESS;

    switch (io_switch_type)
    {
        /* Not supported by current SDIO HAL implementation */
        case _CYHAL_SDXX_IO_VOLT_ACTION_NEGOTIATE:
        {
            cyhal_sdhc_t *sdhc_obj = (cyhal_sdhc_t *) sdxx->obj;

            /*  Bus width and card frequency settings are initialized to default during negotiation.
            *   Saving the parameters to restore them after I/O switch is done. */
            uint8_t sd_bus_width_before_switch = cyhal_sdhc_get_bus_width(sdhc_obj);
            uint32_t sd_freq_before_switch = cyhal_sdhc_get_frequency(sdhc_obj);

