RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_sdhc.c
        if (cfg->clock == NULL)
        {
            result = _cyhal_utils_allocate_clock(&(sdxx->clock), &sdhc, CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT, true);
            if (CY_RSLT_SUCCESS == result)
            {
                sdxx->clock_owned = true;
                result = _cyhal_utils_set_clock_frequency2(&(sdxx->clock), MAX_FREQUENCY, &CYHAL_CLOCK_TOLERANCE_5_P);
            }
            if (CY_RSLT_SUCCESS == result && !cyhal_clock_is_enabled(&(sdxx->clock)))
            {
                result = cyhal_clock_set_enabled(&(sdxx->clock), true, true);
            }
        }
        else
        {
            if (cfg->clock->block == CYHAL_CLOCK_BLOCK_HF)
            {
                sdxx->clock = *cfg->clock;
                obj->frequencyhal_hz = cyhal_clock_get_frequency(&(sdxx->clock));
            }

            if ((cfg->clock->block != CYHAL_CLOCK_BLOCK_HF) || (obj->frequencyhal_hz == 0))
            {
                result = CYHAL_SDIO_RSLT_ERR_CLOCK;
            }
        }

        if (CY_RSLT_SUCCESS == result)
        {
            if (sdxx->dc_configured)
            {
                sdxx->resource = *(cfg->resource);
            }
            else
            {
                sdxx->resource = sdhc;
                result = cyhal_hwmgr_reserve(&sdhc);
            }
        }
    }

        if (result == CY_RSLT_SUCCESS)
        {
            sdxx->base = _CYHAL_SDHC_BASE_ADDRESSES[sdxx->resource.block_num];
            sdxx->data_transfer_status = _CYHAL_SDXX_NOT_RUNNING;

            /* Enable the SDHC block */
            Cy_SD_Host_Enable(sdxx->base);

        /* Configure SD Host to operate */
        result = (cy_rslt_t)Cy_SD_Host_Init(sdxx->base, cfg->host_config, &sdxx->context);

        /* Register SDIO Deep Sleep Callback */
        if (CY_RSLT_SUCCESS == result)
        {
            sdxx->context.cardType = CY_SD_HOST_SDIO;
            sdxx->pm_transition_pending = false;
            sdxx->pm_callback_data.callback = &_cyhal_sdio_syspm_callback;
            sdxx->pm_callback_data.states = (cyhal_syspm_callback_state_t)(CYHAL_SYSPM_CB_CPU_DEEPSLEEP | CYHAL_SYSPM_CB_SYSTEM_HIBERNATE);
            sdxx->pm_callback_data.next = NULL;
            sdxx->pm_callback_data.args = sdxx;
            /* The CYHAL_SYSPM_BEFORE_TRANSITION mode cannot be ignored because the PM handler
                * calls the PDL deep-sleep callback that disables the block in this mode before transitioning.
                */
            sdxx->pm_callback_data.ignore_modes = (cyhal_syspm_callback_mode_t)0;

            _cyhal_syspm_register_peripheral_callback(&(sdxx->pm_callback_data));
        }

        if (result == CY_RSLT_SUCCESS)
        {
            /* Don't enable any error interrupts for now */
            Cy_SD_Host_SetErrorInterruptMask(sdxx->base, 0UL);

            /* Clear all interrupts */
            Cy_SD_Host_ClearErrorInterruptStatus(sdxx->base, _CYHAL_SDIO_SET_ALL_INTERRUPTS_MASK);
            Cy_SD_Host_ClearNormalInterruptStatus(sdxx->base, _CYHAL_SDIO_SET_ALL_INTERRUPTS_MASK);

            sdxx->irq_cause = 0UL;
            obj->events    = 0UL;

            sdxx->callback_data.callback = NULL;
            sdxx->callback_data.callback_arg = NULL;
            _cyhal_sdxx_config_structs[sdxx->resource.block_num] = sdxx;

            #if defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)
            _cyhal_sdxx_semaphore_status[sdxx->resource.block_num] = _CYHAL_SDXX_SEMA_NOT_INITED;
            #endif /* defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE) */

            _cyhal_system_irq_t irqn = _CYHAL_SDHC_IRQ_N[sdxx->resource.block_num];
            _cyhal_irq_register(irqn, CYHAL_ISR_PRIORITY_DEFAULT, _cyhal_sdio_irq_handler);
            _cyhal_irq_enable(irqn);

            result = (cy_rslt_t)Cy_SD_Host_SetHostBusWidth(sdxx->base, CY_SD_HOST_BUS_WIDTH_4_BIT);
        }

        /* Change the host SD clock to 400 kHz */
        if (result == CY_RSLT_SUCCESS)
        {
            uint32_t freq = _CYHAL_SDIO_HOST_CLK_400K;
            result = _cyhal_sdxx_sdcardchangeclock(sdxx, &freq, sdxx->low_voltage_io_set, false);
            if (result == CY_RSLT_SUCCESS)
            {
                obj->frequencyhal_hz = freq;
                obj->block_size = _CYHAL_SDIO_64B_BLOCK;
            }
        }
    }

    if (result != CY_RSLT_SUCCESS)
    {
        cyhal_sdio_free(obj);
    }

    return result;
}

cy_rslt_t cyhal_sdio_init(cyhal_sdio_t *obj, cyhal_gpio_t cmd, cyhal_gpio_t clk, cyhal_gpio_t data0, cyhal_gpio_t data1,
        cyhal_gpio_t data2, cyhal_gpio_t data3)
{
    cy_en_sd_host_card_capacity_t card_capacity = CY_SD_HOST_SDSC;
    cy_en_sd_host_card_type_t card_type = CY_SD_HOST_NOT_EMMC;
    uint32_t rca = 0u;
    const cy_stc_sd_host_init_config_t host_config =
    {
        .emmc = false,
        .dmaType = CY_SD_HOST_DMA_ADMA2,
        .enableLedControl = false,
    };
    cy_stc_sd_host_sd_card_config_t card_config =
    {
        .lowVoltageSignaling = false,
        .busWidth = CY_SD_HOST_BUS_WIDTH_4_BIT,
        .cardType = &card_type,
        .rca = &rca,
        .cardCapacity = &card_capacity,
    };
    const cyhal_sdio_configurator_t cfg = {
        .resource = NULL,
        .host_config = &host_config,
		.card_config = &card_config,
        .clock = NULL,
        .gpios = {clk, cmd, { data0, data1, data2, data3 } }
    };
    return _cyhal_sdio_init_common(obj, &cfg);
}

void cyhal_sdio_free(cyhal_sdio_t *obj)
{
    CY_ASSERT(NULL != obj);

    _cyhal_sdxx_t *sdxx = &(obj->sdxx);

    if (NULL != sdxx->base)
    {
        _cyhal_system_irq_t irqn = _CYHAL_SDHC_IRQ_N[sdxx->resource.block_num];
        _cyhal_irq_free(irqn);

        #if defined(CY_RTOS_AWARE) || defined(COMPONENT_RTOS_AWARE)
        if (_CYHAL_SDXX_SEMA_NOT_INITED != _cyhal_sdxx_semaphore_status[sdxx->resource.block_num])
        {
            cy_rtos_deinit_semaphore(&(_cyhal_sdxx_semaphore_xfer_done[sdxx->resource.block_num]));
            _cyhal_sdxx_semaphore_status[sdxx->resource.block_num] = _CYHAL_SDXX_SEMA_NOT_INITED;
        }
        #endif /* CY_RTOS_AWARE or COMPONENT_RTOS_AWARE defined */

        Cy_SD_Host_DeInit(sdxx->base);
        sdxx->data_transfer_status = _CYHAL_SDXX_NOT_RUNNING;

        if (!sdxx->dc_configured)
        {
            cyhal_hwmgr_free(&(sdxx->resource));
        }
        sdxx->base = NULL;

