RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_sdhc.c
    /* Configure non-interrupt based event(s) */
    if (0U != ((uint32_t) event & _CYHAL_SDIO_INTERFACE_CHANGE_MASK))
    {
        if (enable)
        {
            obj->events |= (uint32_t) event;
        }
        else
        {
            obj->events &= (uint32_t) ~((uint32_t) event);
        }
    }
}

cy_rslt_t cyhal_sdio_set_io_voltage(cyhal_sdio_t *obj, cyhal_gpio_t io_volt_sel, cyhal_sdio_io_voltage_t io_voltage,
                                    cyhal_sdio_io_volt_action_type_t io_switch_type)
{
    CY_ASSERT(NULL != obj);
    cy_rslt_t result = CY_RSLT_SUCCESS;

    _cyhal_sdxx_t *sdxx = &(obj->sdxx);

    if (NC != io_volt_sel)
    {
        /* Configure provided pin it was not yet configured */
        if (NC == sdxx->pin_io_vol_sel)
        {
            result = _cyhal_sdxx_setup_pin(sdxx, io_volt_sel, cyhal_pin_map_sdhc_io_volt_sel,
                CYHAL_PIN_MAP_DRIVE_MODE_SDHC_IO_VOLT_SEL,
                _CYHAL_SDHC_ELEM_COUNT(cyhal_pin_map_sdhc_io_volt_sel), &(sdxx->pin_io_vol_sel),
                _CYHAL_SDHC_CARD_IO_VOLTAGE, true);
        }
        /* io volt sel pin is already configured and user provided other pin */
        else if (io_volt_sel != sdxx->pin_io_vol_sel)
        {
            result = CYHAL_SDIO_RSLT_ERR_IO_VOLT_SEL_PIN_CONFIGURED;
        }
    }

    if (CY_RSLT_SUCCESS == result)
    {
        result = _cyhal_sdxx_set_io_voltage(sdxx, (cyhal_sdxx_io_voltage_t)io_voltage,
            (_cyhal_sdxx_io_switch_action_t)io_switch_type);
    }

    return result;
}

cy_rslt_t cyhal_sdio_init_cfg(cyhal_sdio_t *obj, const cyhal_sdio_configurator_t *cfg)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != cfg);
    return _cyhal_sdio_init_common(obj, cfg);
}

#if defined(__cplusplus)
}
#endif

#endif /* CYHAL_DRIVER_AVAILABLE_SDHC */
